<?php

return [
    'username.required' => 'Поле имя пользователя обязательно для заполнения.',
    'username.unique' => 'Такое имя пользователя уже занято.',
    'username.max' => 'Имя пользователя не может превышать :max символов.',
    'email.required' => 'Поле email обязательно для заполнения.',
    'email.email' => 'Email должен быть действительным адресом электронной почты.',
    'email.unique' => 'Этот email уже занят.',
    'email.max' => 'Email не может превышать :max символов.',
    'password.required' => 'Поле пароля обязательно для заполнения.',
    'password.string' => 'Пароль должен быть строкой.',
    'password.min' => 'Пароль должен содержать не менее :min символов.',
    'password.regex' => 'Неверный формат пароля. Он должен содержать как минимум одну заглавную букву, одну строчную букву, одну цифру, один специальный символ и быть длиной не менее 8 символов.',
    'password.confirmed' => 'Подтверждение пароля не совпадает.'
];
