<?php

return [
    'username.required' => 'Поле "Имя пользователя" обязательно для заполнения.',
    'username.string' => 'Имя пользователя должно быть строкой.',
    'username.max' => 'Имя пользователя не должно превышать :max символов.',
    'username.unique' => 'Имя пользователя уже занято.',
    'name.string' => 'Имя должно быть строкой.',
    'name.max' => 'Имя не должно превышать :max символов.',
    'title.string' => 'Название должно быть строкой.',
    'title.max' => 'Название не должно превышать :max символов.',
    'phone.string' => 'Номер телефона должен быть строкой.',
    'phone.max' => 'Номер телефона не должен превышать :max символов.',
    'email.required' => 'Поле "Email" обязательно для заполнения.',
    'email.string' => 'Email должен быть строкой.',
    'email.email' => 'Email должен быть действительным адресом электронной почты.',
    'email.max' => 'Email не должен превышать :max символов.',
    'email.unique' => 'Email уже занят.',
    'about.string' => 'Информация должна быть строкой.',
    'image_id.exists' => 'Выбранное изображение недействительно.',
];
